src/Catalogs/Водители/Водители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Водители</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительскоеУдостоверение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Водители/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверкаНаличияДубликата(Отказ);
	СформироватьНаименование();
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаНаличияДубликата(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Водители.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Водители КАК Водители
	               |ГДЕ
	               |	Водители.ФизическоеЛицо = &ФизЛицо
	               |	И Водители.Перевозчик = &Перевозчик
	               |	И Водители.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ФизЛицо", Объект.ФизическоеЛицо);
	Запрос.УстановитьПараметр("Перевозчик", Объект.Перевозчик);
	
	Если НЕ Запрос.Выполнить().Пустой() тогда
		ОбщегоНазначения.СообщитьПользователю("Водитель """+Объект.ФизическоеЛицо+""", работающий на организацию "+Объект.Перевозчик + ", уже существует в базе данных!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Наименование = СокрЛП(Строка(Объект.ФизическоеЛицо));
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоляФормы(Элемент)
	СформироватьНаименование();
КонецПроцедуры
